{
  "id": "mechanist",
  "name": "Mechanist",
  "base_class": "tinker",
  "description": "Tinkers who have specialized in advanced mechanical systems and automated constructs, creating complex machines that can operate independently and perform sophisticated tasks beyond the capabilities of simple gadgets.",
  "level_requirement": 10,
  "role": "Utility-Control",
  "primary_stats": ["Intelligence", "Constitution"],
  "secondary_stats": ["Dexterity", "Wisdom"],
  "resource_systems": [
    {
      "name": "Energy",
      "description": "Physical and mental energy that powers invention and device operation",
      "max_value": "30 + (Constitution modifier × 6) + (level × 6)",
      "regeneration": "4 per 6 seconds, +7 when operating or repairing complex machines",
      "mechanics": [
        "Energy points are spent to operate devices and power mechanical constructs",
        "Some constructs require maintaining focus, consuming energy over time",
        "Short rests restore a significant portion of maximum energy",
        "Depleted energy causes penalties to construct effectiveness and operation",
        "Can be temporarily boosted through inspiration in critical situations",
        "Successful construct operation or repair restores a portion of energy"
      ]
    },
    {
      "name": "Scrap",
      "description": "Raw materials and components that can be salvaged and repurposed for inventions",
      "max_value": "150",
      "regeneration": "Builds when salvaging items or collecting materials, decreases when crafting",
      "mechanics": [
        "Increases by 15 when salvaging mechanical items or technological components",
        "Increases by 20 when discovering rare materials or components",
        "Decreases when crafting constructs or inventions based on complexity",
        "Decreases by 10 per hour when maintaining multiple active constructs",
        "Can be spent to create temporary constructs or repair damaged inventions",
        "Higher Scrap quality increases construct effectiveness and durability"
      ]
    },
    {
      "name": "Automation",
      "description": "Measure of your ability to create and control automated systems",
      "max_value": "100",
      "regeneration": "Builds when successfully operating or improving automated systems",
      "mechanics": [
        "Increases by 10 when constructs successfully complete assigned tasks",
        "Increases by 15 when improving or optimizing automated systems",
        "Decreases by 10 when constructs malfunction or fail assigned tasks",
        "Decreases by 15 when automated systems are damaged or destroyed",
        "Can be spent to enhance construct performance or execute complex automated sequences",
        "Higher Automation increases the intelligence and independence of constructs"
      ]
    }
  ],
  "class_mechanics": [
    {
      "name": "Advanced Mechanical Aptitude",
      "description": "Mastery of complex mechanical systems and principles",
      "effects": [
        "Can design and build sophisticated mechanical constructs",
        "Able to repair and improve complex machines with minimal tools",
        "Can identify and exploit weaknesses in advanced mechanical systems",
        "Presence enhances the performance of nearby mechanical devices",
        "Can reverse-engineer and replicate complex mechanical technology"
      ]
    },
    {
      "name": "Construct Commander",
      "description": "Ability to control multiple mechanical constructs simultaneously",
      "effects": [
        "Can issue complex commands to constructs telepathically",
        "Able to coordinate multiple constructs for synchronized actions",
        "Can perceive through construct sensors at limited range",
        "Presence strengthens the connection with controlled constructs",
        "Can temporarily take direct control of a construct for precise operations"
      ]
    },
    {
      "name": "Efficiency Optimization",
      "description": "Skill at maximizing the performance of mechanical systems",
      "effects": [
        "Can enhance construct performance beyond normal parameters",
        "Able to reduce energy consumption of mechanical devices",
        "Can identify and eliminate inefficiencies in mechanical systems",
        "Presence improves the operational efficiency of nearby machines",
        "Can push constructs to temporary performance peaks in critical situations"
      ]
    },
    {
      "name": "Adaptive Engineering",
      "description": "Ability to modify designs and systems to meet changing needs",
      "effects": [
        "Can quickly modify constructs to adapt to new challenges",
        "Able to incorporate new materials and components on the fly",
        "Can repurpose existing constructs for different functions",
        "Presence encourages creative problem-solving in technical situations",
        "Can develop innovative solutions to unexpected technical problems"
      ]
    }
  ],
  "skill_trees": [
    {
      "name": "Construct Specialist",
      "focus": "Creation and control of mechanical constructs",
      "key_abilities": [
        "Autonomous Constructs: Create mechanical assistants that operate independently",
        "Multi-Construct Control: Simultaneously control multiple constructs with precision",
        "Construct Synergy: Enhance construct effectiveness when operating in groups"
      ]
    },
    {
      "name": "Systems Engineer",
      "focus": "Design and optimization of complex mechanical systems",
      "key_abilities": [
        "Efficiency Maximization: Dramatically improve the performance of mechanical systems",
        "Integrated Systems: Create interconnected mechanical networks with enhanced capabilities",
        "Adaptive Reconfiguration: Quickly modify systems to meet changing requirements"
      ]
    },
    {
      "name": "Technological Innovator",
      "focus": "Development of cutting-edge technological solutions",
      "key_abilities": [
        "Breakthrough Design: Create revolutionary devices that solve complex problems",
        "Experimental Technology: Develop and test advanced technological concepts",
        "Technical Improvisation: Create effective solutions with limited resources"
      ]
    }
  ],
  "advancement_requirements": {
    "level": 10,
    "quests": ["The Master's Workshop", "Automation Innovation"],
    "skill_points": "At least 5 points in any tinker skill tree",
    "challenges": ["Successfully create and operate an autonomous construct", "Design and build a complex mechanical system"]
  },
  "progression_path": {
    "hero_classes": [
      {
        "id": "artificer",
        "name": "Artificer",
        "alignment": "Good",
        "level_requirement": 30,
        "description": "Mechanists who use their technological prowess to create devices that protect, heal, and enhance the capabilities of allies."
      },
      {
        "id": "techsmith",
        "name": "Techsmith",
        "alignment": "Neutral",
        "level_requirement": 30,
        "description": "Mechanists who focus on pushing the boundaries of technological innovation, creating increasingly advanced and efficient machines."
      },
      {
        "id": "warmachine",
        "name": "Warmachine",
        "alignment": "Evil",
        "level_requirement": 30,
        "description": "Mechanists who specialize in creating devastating weapons and combat constructs designed to destroy and dominate."
      }
    ]
  },
  "legendary_items": [
    {
      "name": "Omnitool",
      "type": "Tool",
      "effects": [
        "Can transform into any tool needed for mechanical work",
        "Provides significant bonuses to repair and construction speed",
        "Can automatically analyze mechanical systems to identify problems"
      ]
    },
    {
      "name": "Constructor's Gauntlets",
      "type": "Hands",
      "effects": [
        "Enhances precision and strength for mechanical work",
        "Can project a force field to hold components in place",
        "Provides tactile feedback when interacting with mechanical systems"
      ]
    }
  ],
  "lore": "Mechanists represent tinkers who have transcended basic invention to master the creation and control of complex mechanical systems and autonomous constructs. Where ordinary tinkers might focus on individual gadgets or simple devices, Mechanists develop integrated systems of machines that can work together to accomplish sophisticated tasks with minimal direct oversight. The path to becoming a Mechanist often involves years of study and experimentation with increasingly complex mechanical designs, culminating in the creation of truly autonomous constructs that can operate independently. Those who succeed find themselves capable of building mechanical assistants and systems that dramatically extend their capabilities, allowing them to solve problems and overcome challenges that would be impossible for a single individual. Mechanists serve various roles in society, from developing industrial automation systems that increase productivity to creating specialized constructs for dangerous environments where humans cannot safely operate. Some focus on practical applications of their technology, while others push the boundaries of what's possible through experimental designs and theoretical innovation. Their ability to create machines tailored to specific needs makes them invaluable in complex operations where standard tools and approaches would be insufficient. Though they may lack the raw power of warriors or the magical versatility of spellcasters, the mechanical ingenuity and adaptive problem-solving of Mechanists allow them to develop unique solutions to almost any challenge they encounter."
}
