{
  "id": "tinker",
  "name": "Tinker",
  "description": "Ingenious inventors and mechanical specialists who harness technology and engineering to create devices, gadgets, and contraptions that solve problems and overcome challenges.",
  "level_requirement": 1,
  "role": "Utility-Support",
  "primary_stats": ["Intelligence", "Dexterity"],
  "secondary_stats": ["Constitution", "Wisdom"],
  "resource_systems": [
    {
      "name": "Energy",
      "description": "Physical and mental energy that powers invention and device operation",
      "max_value": "20 + (Constitution modifier × 5) + (level × 5)",
      "regeneration": "3 per 6 seconds, +5 when operating or repairing devices",
      "mechanics": [
        "Energy points are spent to operate devices and power inventions",
        "Some devices require maintaining focus, consuming energy over time",
        "Short rests restore a portion of maximum energy",
        "Depleted energy causes penalties to invention effectiveness and operation speed",
        "Can be temporarily boosted through inspiration in critical situations",
        "Successful invention operation or repair restores a portion of energy"
      ]
    },
    {
      "name": "Scrap",
      "description": "Raw materials and components that can be salvaged and repurposed for inventions",
      "max_value": "100",
      "regeneration": "Builds when salvaging items or collecting materials, decreases when crafting",
      "mechanics": [
        "Increases by 10 when salvaging mechanical items or technological components",
        "Increases by 15 when discovering rare materials or components",
        "Decreases when crafting devices or inventions based on complexity",
        "Decreases by 5 per hour when maintaining multiple active devices",
        "Can be spent to create temporary devices or repair damaged inventions",
        "Higher Scrap quality increases invention effectiveness and durability"
      ]
    }
  ],
  "class_mechanics": [
    {
      "name": "Mechanical Aptitude",
      "description": "Natural talent for understanding and manipulating mechanical systems",
      "effects": [
        "Can quickly analyze and understand the function of mechanical devices",
        "Able to repair damaged devices with minimal tools",
        "Can identify weaknesses in mechanical structures and systems",
        "Presence allows for intuitive operation of unfamiliar machinery",
        "Can improvise tools and simple devices from available materials"
      ]
    },
    {
      "name": "Inventor's Insight",
      "description": "Ability to envision and create innovative solutions to problems",
      "effects": [
        "Can design custom devices to address specific challenges",
        "Able to improve existing designs for enhanced performance",
        "Can combine disparate components in unexpected but effective ways",
        "Presence stimulates creative thinking in allies",
        "Can analyze problems to determine optimal technological solutions"
      ]
    },
    {
      "name": "Gadgeteer",
      "description": "Skill at creating and using compact, specialized devices",
      "effects": [
        "Can create small gadgets with specific functions",
        "Able to carry and maintain multiple gadgets simultaneously",
        "Can quickly deploy gadgets in tactical situations",
        "Presence allows for intuitive coordination of multiple devices",
        "Can modify gadgets on the fly to adapt to changing circumstances"
      ]
    },
    {
      "name": "Technical Knowledge",
      "description": "Comprehensive understanding of scientific and engineering principles",
      "effects": [
        "Can apply theoretical knowledge to practical problems",
        "Able to reverse-engineer unfamiliar technology",
        "Can identify optimal materials and components for specific applications",
        "Presence enhances the effectiveness of collaborative technical work",
        "Can predict the behavior of complex systems based on first principles"
      ]
    }
  ],
  "skill_trees": [
    {
      "name": "Gadget Specialist",
      "focus": "Creation and use of specialized tools and devices",
      "key_abilities": [
        "Pocket Arsenal: Create and maintain multiple compact gadgets",
        "Quick Deploy: Rapidly activate gadgets in combat situations",
        "Adaptive Design: Modify gadgets on the fly to meet changing needs"
      ]
    },
    {
      "name": "Mechanical Engineer",
      "focus": "Building and operating larger mechanical constructs",
      "key_abilities": [
        "Construct Assembly: Build temporary mechanical assistants",
        "Structural Analysis: Identify and exploit weaknesses in structures",
        "Field Repairs: Quickly fix damaged mechanical devices and structures"
      ]
    },
    {
      "name": "Alchemical Innovator",
      "focus": "Combining technology with alchemical principles",
      "key_abilities": [
        "Elemental Infusion: Incorporate elemental properties into devices",
        "Alchemical Catalyst: Create substances that enhance device performance",
        "Transmutation Application: Change material properties for specific uses"
      ]
    }
  ],
  "progression_path": {
    "arch_classes": [
      {
        "id": "mechanist",
        "name": "Mechanist",
        "level_requirement": 10,
        "description": "Tinkers who have specialized in advanced mechanical systems and automated constructs, creating complex machines that can operate independently."
      }
    ]
  },
  "lore": "Tinkers represent the innovative spirit of civilization, constantly pushing the boundaries of what's possible through technology and invention. Unlike the mystical powers of mages or the divine blessings of clerics, tinkers rely on ingenuity, technical knowledge, and practical application to overcome challenges. Their training encompasses not just theoretical understanding but also hands-on experience with a wide range of materials, tools, and mechanical principles, making them versatile problem-solvers in any situation requiring technical solutions. Many tinkers begin their careers as apprentices to established inventors or in academic institutions where they can study existing technology before developing their own innovations. Some are self-taught experimenters who developed their abilities through trial and error, often driven by necessity or curiosity. Regardless of their background, all tinkers share a passion for creation and improvement, constantly seeking to refine their designs and develop new solutions. In dangerous situations, tinkers excel at adapting to unexpected challenges through rapid invention and deployment of specialized devices. Their ability to create tools specifically designed for the task at hand makes them invaluable members of any adventuring party, providing unique solutions that would be impossible through conventional means. Though they may lack the raw power of more combat-focused classes, the versatility and tactical advantages provided by tinkers often prove decisive in complex encounters where creativity trumps brute force."
}
