{
  "id": "commander",
  "name": "Commander",
  "base_class": "soldier",
  "description": "Soldiers who have mastered the art of leadership and battlefield control, able to inspire allies and coordinate devastating tactical maneuvers while maintaining exceptional personal combat prowess.",
  "level_requirement": 10,
  "role": "Tank-Support",
  "primary_stats": ["Strength", "Charisma"],
  "secondary_stats": ["Constitution", "Intelligence"],
  "resource_systems": [
    {
      "name": "Stamina",
      "description": "Physical energy that powers combat abilities and tactical maneuvers",
      "max_value": "30 + (Constitution modifier × 6) + (level × 6)",
      "regeneration": "3 per 6 seconds, +5 during combat",
      "mechanics": [
        "Stamina points are spent to perform special combat maneuvers and tactical abilities",
        "Some abilities require maintaining focus, consuming stamina over time",
        "Short rests restore a significant portion of maximum stamina",
        "Depleted stamina causes penalties to attack speed and defensive capabilities",
        "Can be temporarily boosted through adrenaline in critical situations",
        "Leadership abilities can transfer stamina to allies or improve their regeneration"
      ]
    },
    {
      "name": "Combat Readiness",
      "description": "State of tactical awareness and preparation that enhances combat effectiveness",
      "max_value": "150",
      "regeneration": "Builds during combat, decreases during periods of inaction",
      "mechanics": [
        "Increases by 15 when landing critical hits or successfully defending against attacks",
        "Increases by 10 per 10 seconds in active combat",
        "Decreases by 15 when taking critical hits or being caught off-guard",
        "Decreases by 10 per minute when out of combat",
        "Can be spent to enhance combat abilities or execute special maneuvers",
        "Can be partially transferred to allies to improve their combat performance"
      ]
    },
    {
      "name": "Command Authority",
      "description": "Measure of leadership influence and tactical control over the battlefield",
      "max_value": "100",
      "regeneration": "Builds when successfully leading allies or controlling battlefield conditions",
      "mechanics": [
        "Increases by 10 when allies successfully follow your tactical directions",
        "Increases by 5 when maintaining advantageous battlefield positions",
        "Decreases by 10 when allies suffer significant casualties under your command",
        "Decreases by 5 when forced to retreat or lose tactical advantage",
        "Can be spent to issue powerful commands or implement complex battle strategies"
      ]
    }
  ],
  "class_mechanics": [
    {
      "name": "Battlefield Leadership",
      "description": "Ability to direct allies and coordinate complex tactical maneuvers",
      "effects": [
        "Can issue commands that provide significant combat bonuses to allies",
        "Able to coordinate group attacks that deal enhanced damage",
        "Can establish formations that provide defensive or offensive advantages",
        "Presence improves morale, reducing the effects of fear and intimidation",
        "Can quickly analyze battlefield conditions and communicate optimal strategies"
      ]
    },
    {
      "name": "Advanced Weapons Mastery",
      "description": "Superior proficiency with weapons and understanding of combat techniques",
      "effects": [
        "Significantly increased damage and accuracy with all conventional weapons",
        "Can identify and exploit critical weaknesses in enemy defenses",
        "Able to adapt fighting style to counter specific enemy tactics",
        "Can teach effective combat techniques to allies, improving their performance",
        "Presence intimidates enemies, potentially reducing their combat effectiveness"
      ]
    },
    {
      "name": "Tactical Genius",
      "description": "Exceptional understanding of battlefield dynamics and strategic planning",
      "effects": [
        "Can predict enemy movements and prepare effective countermeasures",
        "Able to identify and exploit terrain advantages for maximum tactical benefit",
        "Can develop complex battle plans that account for various contingencies",
        "Presence provides tactical insights to allies, improving their positioning",
        "Can quickly adapt strategies when battlefield conditions change"
      ]
    },
    {
      "name": "Inspiring Presence",
      "description": "Charismatic leadership that motivates allies and intimidates enemies",
      "effects": [
        "Allies within range gain bonuses to attack, defense, and morale",
        "Can rally demoralized allies, removing fear effects and restoring combat effectiveness",
        "Able to intimidate enemies, potentially causing them to hesitate or retreat",
        "Presence naturally draws enemy attention, protecting more vulnerable allies",
        "Can inspire heroic efforts from allies in critical situations"
      ]
    }
  ],
  "skill_trees": [
    {
      "name": "Master Tactician",
      "focus": "Battlefield control and strategic planning",
      "key_abilities": [
        "Perfect Formation: Establish a formation that provides significant bonuses to all participating allies",
        "Tactical Insight: Identify and mark enemy weaknesses, increasing damage dealt to those targets",
        "Battlefield Control: Manipulate enemy positioning through superior tactical maneuvers"
      ]
    },
    {
      "name": "Inspiring Leader",
      "focus": "Morale and motivation of allies",
      "key_abilities": [
        "Rally the Troops: Remove fear and demoralization effects from allies and grant temporary combat bonuses",
        "Heroic Inspiration: Inspire an ally to perform beyond their normal capabilities for a short time",
        "Commanding Presence: Passively improve the combat performance of nearby allies"
      ]
    },
    {
      "name": "Elite Warrior",
      "focus": "Personal combat excellence",
      "key_abilities": [
        "Combat Mastery: Gain significant bonuses when using your preferred weapon type",
        "Tactical Adaptation: Quickly adjust fighting style to counter enemy tactics",
        "Veteran's Resolve: Ignore the effects of injuries and combat conditions that would hinder others"
      ]
    }
  ],
  "advancement_requirements": {
    "level": 10,
    "quests": ["Leadership Trial", "Tactical Command Exercise"],
    "skill_points": "At least 5 points in any soldier skill tree",
    "challenges": ["Successfully lead a group in combat", "Develop and implement an effective battle strategy"]
  },
  "progression_path": {
    "hero_classes": [
      {
        "id": "champion",
        "name": "Champion",
        "alignment": "Good",
        "level_requirement": 30,
        "description": "Commanders who embody the highest ideals of honor and justice, inspiring allies with their heroic deeds and selfless protection of the innocent."
      },
      {
        "id": "warlord",
        "name": "Warlord",
        "alignment": "Neutral",
        "level_requirement": 30,
        "description": "Commanders who focus on victory through superior tactics and battlefield dominance, valuing efficiency and results above all else."
      },
      {
        "id": "tyrant",
        "name": "Tyrant",
        "alignment": "Evil",
        "level_requirement": 30,
        "description": "Commanders who rule through fear and intimidation, crushing opposition with brutal tactics and forcing absolute obedience from their followers."
      }
    ]
  },
  "legendary_items": [
    {
      "name": "Banner of Command",
      "type": "Relic",
      "effects": [
        "Allies within 30 meters gain +20% to attack and defense",
        "Command Authority regeneration increased by 50%",
        "Can be planted to create a rallying point that provides additional bonuses"
      ]
    },
    {
      "name": "Commander's Blade",
      "type": "Weapon",
      "effects": [
        "Attacks have a chance to mark enemies, increasing damage they take from all sources",
        "Can be raised to issue commands with greater effect and range",
        "Killing blows inspire nearby allies, restoring some of their resources"
      ]
    }
  ],
  "lore": "Commanders represent soldiers who have transcended mere combat proficiency to become true leaders on the battlefield. Where ordinary soldiers focus primarily on their individual combat skills, Commanders develop the ability to coordinate groups, inspire allies, and control the flow of battle through superior tactical understanding. The path to becoming a Commander often involves formal leadership training in military academies or hard-earned experience leading troops in actual combat situations. Those who succeed gain not only enhanced personal combat abilities but also the respect and loyalty of those who serve under them. Commanders serve various roles in military organizations, from squad leaders who directly participate in combat alongside their troops to field generals who oversee large-scale operations. Some focus on inspiring heroic deeds from their followers, while others emphasize efficient tactics and battlefield control. Still others rule through intimidation and fear, demanding absolute obedience and crushing any sign of weakness. Regardless of their leadership style, all Commanders share an exceptional understanding of battlefield dynamics and the ability to bring out the best (or worst) in those who follow them. Their presence can turn the tide of battle, whether by coordinating devastating group attacks, maintaining defensive formations that withstand superior numbers, or simply inspiring ordinary soldiers to fight beyond their normal capabilities."
}
