{
  "id": "soldier",
  "name": "Soldier",
  "description": "Disciplined warriors trained in the art of conventional warfare, specializing in weapons mastery, tactical combat, and battlefield control through superior training and equipment.",
  "level_requirement": 1,
  "role": "Tank-Damage",
  "primary_stats": ["Strength", "Constitution"],
  "secondary_stats": ["Dexterity", "Intelligence"],
  "resource_systems": [
    {
      "name": "Stamina",
      "description": "Physical energy that powers combat abilities and tactical maneuvers",
      "max_value": "20 + (Constitution modifier × 5) + (level × 5)",
      "regeneration": "2 per 6 seconds, +3 during combat",
      "mechanics": [
        "Stamina points are spent to perform special combat maneuvers and tactical abilities",
        "Some abilities require maintaining focus, consuming stamina over time",
        "Short rests restore a portion of maximum stamina",
        "Depleted stamina causes penalties to attack speed and defensive capabilities",
        "Can be temporarily boosted through adrenaline in critical situations"
      ]
    },
    {
      "name": "Combat Readiness",
      "description": "State of tactical awareness and preparation that enhances combat effectiveness",
      "max_value": "100",
      "regeneration": "Builds during combat, decreases during periods of inaction",
      "mechanics": [
        "Increases by 10 when landing critical hits or successfully defending against attacks",
        "Increases by 5 per 10 seconds in active combat",
        "Decreases by 10 when taking critical hits or being caught off-guard",
        "Decreases by 5 per minute when out of combat",
        "Can be spent to enhance combat abilities or execute special maneuvers"
      ]
    }
  ],
  "class_mechanics": [
    {
      "name": "Weapons Mastery",
      "description": "Exceptional proficiency with a wide range of conventional weapons",
      "effects": [
        "Increased damage and accuracy with all conventional weapons",
        "Reduced cooldown on weapon-based abilities",
        "Can switch between weapons during combat without penalties",
        "Able to identify and exploit weaknesses in enemy weapons and armor",
        "Can use improvised weapons with the same proficiency as proper weapons"
      ]
    },
    {
      "name": "Combat Tactics",
      "description": "Knowledge of battlefield strategies and tactical maneuvers",
      "effects": [
        "Can analyze enemy formations and identify tactical advantages",
        "Able to coordinate attacks with allies for increased effectiveness",
        "Gain combat bonuses when fighting in advantageous positions",
        "Can predict enemy movements and prepare appropriate counters",
        "Presence improves the combat effectiveness of nearby allies"
      ]
    },
    {
      "name": "Battle Hardened",
      "description": "Physical and mental resilience developed through combat experience",
      "effects": [
        "Increased resistance to physical damage and status effects",
        "Reduced recovery time from injuries and negative effects",
        "Can continue fighting effectively even when severely wounded",
        "Resistance to fear, intimidation, and morale-affecting abilities",
        "Presence bolsters the courage and determination of allies"
      ]
    },
    {
      "name": "Field Expertise",
      "description": "Practical knowledge of survival, equipment maintenance, and battlefield conditions",
      "effects": [
        "Can maintain and repair equipment in the field",
        "Able to adapt to various terrain and weather conditions",
        "Can identify and utilize environmental advantages in combat",
        "Increased effectiveness when using military equipment and supplies",
        "Can establish secure camps and defensive positions quickly"
      ]
    }
  ],
  "skill_trees": [
    {
      "name": "Frontline Fighter",
      "focus": "Direct combat and defensive capabilities",
      "key_abilities": [
        "Shield Wall: Significantly increase defense and block chance",
        "Taunt: Force enemies to attack you instead of allies",
        "Counterattack: Automatically strike back after successfully blocking an attack"
      ]
    },
    {
      "name": "Combat Specialist",
      "focus": "Weapon techniques and offensive capabilities",
      "key_abilities": [
        "Precision Strike: Target vital points for increased damage",
        "Weapon Expertise: Gain special abilities based on equipped weapon type",
        "Combat Flow: Chain attacks together for increasing damage bonuses"
      ]
    },
    {
      "name": "Field Tactician",
      "focus": "Battlefield control and tactical advantages",
      "key_abilities": [
        "Tactical Assessment: Identify enemy weaknesses and relay them to allies",
        "Coordinated Strike: Set up powerful combination attacks with allies",
        "Battlefield Control: Manipulate enemy positioning through tactical maneuvers"
      ]
    }
  ],
  "progression_path": {
    "arch_classes": [
      {
        "id": "commander",
        "name": "Commander",
        "level_requirement": 10,
        "description": "Soldiers who have mastered the art of leadership and battlefield control, able to inspire allies and coordinate devastating tactical maneuvers."
      }
    ]
  },
  "lore": "Soldiers represent the backbone of any military force, combining disciplined training with practical combat experience to become effective warriors in any battlefield situation. Unlike the mystical powers of mages or the divine blessings of clerics, soldiers rely on honed skills, tactical knowledge, and physical prowess to overcome their enemies. Their training encompasses not just combat techniques but also field survival, equipment maintenance, and battlefield tactics, making them versatile and adaptable fighters. Many soldiers begin their careers in formal military organizations, where they learn the fundamentals of warfare through rigorous training and live combat exercises. Others may develop their skills through militia service, mercenary work, or out of necessity in dangerous borderlands. Regardless of their background, all soldiers share a practical approach to combat and a respect for discipline and preparation. In battle, soldiers are reliable combatants who can adapt to changing situations, utilize available resources effectively, and maintain their effectiveness even in prolonged engagements. Their understanding of tactical positioning and battlefield dynamics makes them valuable members of any adventuring party, able to protect vulnerable allies while dealing significant damage to enemies. Though they may lack the flashy abilities of more magical classes, the consistent performance and versatility of soldiers make them indispensable in virtually any combat situation."
}
