{
  "id": "shaman",
  "name": "Shaman",
  "description": "Spiritual intermediaries between the mortal world and the realm of spirits, capable of communing with ancestral forces and elemental powers to heal allies and harm enemies.",
  "level_requirement": 1,
  "role": "Support-Damage",
  "primary_stats": ["Wisdom", "Constitution"],
  "secondary_stats": ["Intelligence", "Charisma"],
  "resource_systems": [
    {
      "name": "Mana",
      "description": "Mystical energy that powers spells and spiritual abilities",
      "max_value": "20 + (Wisdom modifier × 5) + (level × 5)",
      "regeneration": "2 per 6 seconds, +3 when near natural elements",
      "mechanics": [
        "Mana points are spent to cast spells and invoke spiritual powers",
        "Some abilities require maintaining focus, consuming mana over time",
        "Communing with spirits in natural environments increases mana regeneration rate by 300%",
        "Depleted mana causes penalties to spell effectiveness and spirit connection",
        "Can channel mana into totems and spirit vessels for persistent effects"
      ]
    },
    {
      "name": "Spirit Attunement",
      "description": "Connection to the spirit world that enhances spiritual abilities",
      "max_value": "100",
      "regeneration": "Builds when communing with spirits, decreases when spirits are angered",
      "mechanics": [
        "Increases by 10 when performing rituals honoring spirits",
        "Increases by 5 per minute when in spiritually significant locations",
        "Decreases by 10 when spirits are disrespected or dismissed",
        "Decreases by 5 per minute when in spiritually corrupted areas",
        "Can be spent to enhance spiritual abilities or summon spirit allies"
      ]
    }
  ],
  "class_mechanics": [
    {
      "name": "Spirit Communion",
      "description": "Ability to communicate with and channel the power of spirits",
      "effects": [
        "Can see and communicate with spirits invisible to others",
        "Able to channel spirits temporarily for enhanced abilities",
        "Can negotiate with local spirits for information or assistance",
        "Presence soothes angry spirits and helps guide lost ones",
        "Can sense spiritual disturbances and imbalances"
      ]
    },
    {
      "name": "Elemental Affinity",
      "description": "Connection to the elemental forces of nature",
      "effects": [
        "Can call upon elemental powers for offensive and defensive abilities",
        "Resistance to elemental damage increases near corresponding natural sources",
        "Can sense elemental imbalances and disturbances",
        "Able to temporarily imbue weapons and armor with elemental properties",
        "Presence can calm or intensify natural elemental phenomena"
      ]
    },
    {
      "name": "Totem Crafting",
      "description": "Ability to create spiritual focuses that channel specific powers",
      "effects": [
        "Can craft totems that provide passive benefits to allies",
        "Totems can be activated for powerful temporary effects",
        "Multiple totems can be maintained simultaneously",
        "Totems act as anchors for spiritual entities and powers",
        "Can sense when totems are disturbed or destroyed"
      ]
    },
    {
      "name": "Ancestral Wisdom",
      "description": "Connection to the knowledge and power of ancestors",
      "effects": [
        "Can call upon ancestral spirits for guidance and knowledge",
        "Gain insights into historical events and forgotten lore",
        "Ancestral spirits provide protection against spiritual threats",
        "Can channel the skills and abilities of specific ancestors temporarily",
        "Presence strengthens the connection between the living and their ancestors"
      ]
    }
  ],
  "skill_trees": [
    {
      "name": "Spirit Speaker",
      "focus": "Communication with and manipulation of spirits",
      "key_abilities": [
        "Spirit Sight: See and communicate with spirits invisible to others",
        "Spirit Pact: Form temporary alliances with local spirits for assistance",
        "Ancestral Guardian: Summon a protective ancestral spirit"
      ]
    },
    {
      "name": "Elemental Shaper",
      "focus": "Manipulation of elemental forces",
      "key_abilities": [
        "Elemental Bolt: Channel pure elemental energy as a ranged attack",
        "Elemental Shield: Create a protective barrier of elemental energy",
        "Elemental Harmony: Gain resistance to all elemental damage"
      ]
    },
    {
      "name": "Ritual Master",
      "focus": "Powerful ceremonies and totem crafting",
      "key_abilities": [
        "Totem of Protection: Create a totem that shields allies from harm",
        "Healing Ritual: Perform a ceremony that heals allies over time",
        "Spirit Journey: Enter a trance to send your spirit to distant locations"
      ]
    }
  ],
  "progression_path": {
    "arch_classes": [
      {
        "id": "spiritwalker",
        "name": "SpiritWalker",
        "level_requirement": 10,
        "description": "Shamans who have deepened their connection to the spirit world, able to walk between realms and channel greater spiritual powers."
      }
    ]
  },
  "lore": "Shamans are the spiritual intermediaries of their communities, maintaining the delicate balance between the mortal world and the realm of spirits. Through rituals, totems, and personal sacrifice, they forge connections with ancestral spirits, elemental forces, and the very essence of nature itself. Their powers are neither arcane like wizards nor divine like clerics, but spiritual—drawing on the ancient bonds between all living things and the unseen forces that permeate the world. Many shamans are called to their path through visions or near-death experiences that open their eyes to the spirit world. Others inherit the mantle from mentors who recognize their innate spiritual sensitivity. Regardless of how they come to their calling, all shamans share a profound respect for the spirits they commune with and a deep understanding of the responsibilities that come with their powers. In battle, shamans are versatile combatants who can heal allies, harm enemies, and control the battlefield through elemental and spiritual forces. Their connection to the elements allows them to adapt to various situations, while their spiritual allies provide unique advantages that conventional magic users cannot match. Though their methods may seem primitive to some, the wisdom and power of shamans have endured for countless generations, proving their effectiveness in maintaining the balance between worlds."
}
