{
  "id": "spiritwalker",
  "name": "SpiritWalker",
  "base_class": "shaman",
  "description": "Shamans who have deepened their connection to the spirit world, able to walk between realms and channel greater spiritual powers with unprecedented control and understanding.",
  "level_requirement": 10,
  "role": "Support-Control",
  "primary_stats": ["Wisdom", "Constitution"],
  "secondary_stats": ["Intelligence", "Charisma"],
  "resource_systems": [
    {
      "name": "Mana",
      "description": "Mystical energy that powers spells and spiritual abilities",
      "max_value": "30 + (Wisdom modifier × 6) + (level × 6)",
      "regeneration": "3 per 6 seconds, +5 when near natural elements or spirit anchors",
      "mechanics": [
        "Mana points are spent to cast spells and invoke spiritual powers",
        "Some abilities require maintaining focus, consuming mana over time",
        "Communing with spirits in natural environments increases mana regeneration rate by 400%",
        "Depleted mana causes penalties to spell effectiveness and spirit connection",
        "Can channel mana into totems, spirit vessels, and dimensional anchors for persistent effects"
      ]
    },
    {
      "name": "Spirit Attunement",
      "description": "Connection to the spirit world that enhances spiritual abilities",
      "max_value": "150",
      "regeneration": "Builds when communing with spirits, decreases when spirits are angered",
      "mechanics": [
        "Increases by 15 when performing rituals honoring spirits",
        "Increases by 10 per minute when in spiritually significant locations",
        "Decreases by 15 when spirits are disrespected or dismissed",
        "Decreases by 10 per minute when in spiritually corrupted areas",
        "Can be spent to enhance spiritual abilities or summon powerful spirit allies"
      ]
    },
    {
      "name": "Planar Resonance",
      "description": "Harmony with the different planes of existence that allows for dimensional manipulation",
      "max_value": "100",
      "regeneration": "Builds when traversing between planes or communing with extraplanar entities",
      "mechanics": [
        "Increases by 10 when successfully traversing between planes",
        "Increases by 5 when maintaining balance between different spiritual forces",
        "Decreases by 10 when causing planar disruptions or imbalances",
        "Decreases by 5 when remaining in a single plane for extended periods",
        "Can be spent to open temporary portals or manipulate the boundaries between planes"
      ]
    }
  ],
  "class_mechanics": [
    {
      "name": "Spirit Walking",
      "description": "Ability to project consciousness into the spirit realm while maintaining awareness in the physical world",
      "effects": [
        "Can perceive both physical and spiritual realms simultaneously",
        "Able to interact with spirits and spiritual phenomena directly",
        "Can temporarily shift partially into the spirit realm to avoid physical dangers",
        "Presence in the spirit realm is stronger and more influential",
        "Can guide others on spiritual journeys and protect them from spiritual dangers"
      ]
    },
    {
      "name": "Enhanced Elemental Communion",
      "description": "Deeper connection to elemental forces allowing for greater control and power",
      "effects": [
        "Can call upon multiple elemental powers simultaneously",
        "Elemental abilities are significantly more powerful and controlled",
        "Can perceive elemental imbalances across great distances",
        "Able to temporarily transform parts of the body into elemental forms",
        "Presence can dramatically alter local elemental conditions"
      ]
    },
    {
      "name": "Spirit Binding",
      "description": "Ability to form lasting bonds with spiritual entities for mutual benefit",
      "effects": [
        "Can bind spirits to objects, locations, or willing creatures",
        "Bound spirits provide ongoing benefits or perform specific tasks",
        "Can maintain multiple spirit bindings simultaneously",
        "Able to negotiate more favorable terms with powerful spirits",
        "Can release bound spirits with appropriate ceremonies"
      ]
    },
    {
      "name": "Ancestral Channel",
      "description": "Direct channeling of ancestral spirits for guidance and power",
      "effects": [
        "Can temporarily embody specific ancestral spirits for their abilities",
        "Gain access to ancestral memories and knowledge with perfect recall",
        "Ancestral spirits provide significant protection against spiritual and mental attacks",
        "Can call upon the collective wisdom of ancestors for guidance",
        "Presence strengthens ancestral connections for entire communities"
      ]
    }
  ],
  "skill_trees": [
    {
      "name": "Planar Traveler",
      "focus": "Movement between and manipulation of different planes of existence",
      "key_abilities": [
        "Spirit Step: Briefly step completely into the spirit realm to avoid danger",
        "Planar Anchor: Create a point that allows for easy return from spiritual journeys",
        "Realm Sight: Perceive activities and entities in adjacent planes of existence"
      ]
    },
    {
      "name": "Spirit Binder",
      "focus": "Formation of powerful bonds with spiritual entities",
      "key_abilities": [
        "Greater Spirit Ally: Form a permanent bond with a powerful spirit companion",
        "Spirit Vessel: Create objects that can house and channel specific spirits",
        "Spiritual Convergence: Temporarily merge with a willing spirit for combined power"
      ]
    },
    {
      "name": "Elemental Harmony",
      "focus": "Mastery of elemental forces and their interactions",
      "key_abilities": [
        "Elemental Fusion: Combine multiple elements for powerful hybrid effects",
        "Elemental Attunement: Gain significant resistance to all elemental damage",
        "Elemental Manifestation: Summon pure elemental entities to fight alongside you"
      ]
    }
  ],
  "advancement_requirements": {
    "level": 10,
    "quests": ["Journey to the Spirit Realm", "Communion with the Elemental Lords"],
    "skill_points": "At least 5 points in any shaman skill tree",
    "challenges": ["Successfully bind a powerful spirit", "Maintain balance between opposing elemental forces"]
  },
  "progression_path": {
    "hero_classes": [
      {
        "id": "theurgist",
        "name": "Theurgist",
        "alignment": "Good",
        "level_requirement": 30,
        "description": "SpiritWalkers who have formed deep bonds with benevolent spirits and divine entities, channeling their power to heal, protect, and banish evil."
      },
      {
        "id": "soothsayer",
        "name": "Soothsayer",
        "alignment": "Neutral",
        "level_requirement": 30,
        "description": "SpiritWalkers who have developed the ability to perceive the threads of fate and destiny, gaining profound insights into past, present, and future events."
      },
      {
        "id": "bloodcaller",
        "name": "BloodCaller",
        "alignment": "Evil",
        "level_requirement": 30,
        "description": "SpiritWalkers who have turned to blood magic and alchemical potions, sacrificing traditional spellcasting for powerful combat abilities and automatic magical effects."
      }
    ]
  },
  "legendary_items": [
    {
      "name": "Staff of the Spirit Realms",
      "type": "Weapon",
      "effects": [
        "Increases Spirit Attunement maximum by 50",
        "Allows for more controlled movement between planes",
        "Can store spirits temporarily for later summoning"
      ]
    },
    {
      "name": "Totem of Elemental Mastery",
      "type": "Relic",
      "effects": [
        "Elemental abilities cost 30% less mana",
        "Can channel all four primary elements simultaneously",
        "Provides immunity to one elemental damage type of choice for 1 hour per day"
      ]
    }
  ],
  "lore": "SpiritWalkers represent shamans who have transcended the ordinary boundaries between the physical and spiritual realms, developing the extraordinary ability to exist in both simultaneously. Where ordinary shamans must perform elaborate rituals to commune with spirits, SpiritWalkers can perceive and interact with the spirit world as easily as breathing. This profound connection allows them to negotiate with more powerful spirits, channel greater elemental forces, and even temporarily step between different planes of existence. The path to becoming a SpiritWalker often involves a life-altering spiritual journey—sometimes called a 'spirit death'—where the shaman's consciousness is separated from their body and must navigate the treacherous spirit realm before returning forever changed. Those who succeed gain unprecedented spiritual awareness and control, while those who fail may be lost forever or return as hollow shells. SpiritWalkers serve as crucial mediators between mortal communities and the spirit world, maintaining the delicate balance between realms and ensuring that ancient pacts between mortals and spirits are honored. Some focus on healing spiritual ailments that conventional medicine cannot touch, while others protect communities from malevolent spiritual entities or elemental disasters. Their enhanced connection to ancestral spirits also makes them invaluable keepers of historical knowledge and cultural traditions. Whether they choose to deepen their connection with benevolent spirits, develop their ability to perceive the threads of fate, or turn to more controversial blood magic, all SpiritWalkers command respect from both the living and the dead."
}
