{
  "id": "pathfinder",
  "name": "Pathfinder",
  "base_class": "ranger",
  "description": "Elite rangers who have mastered the art of wilderness survival and developed a mystical connection with nature itself, able to navigate any terrain and commune with the very essence of the wild.",
  "level_requirement": 10,
  "role": "DPS-Utility",
  "primary_stats": ["Dexterity", "Wisdom"],
  "secondary_stats": ["Strength", "Constitution"],
  "resource_systems": [
    {
      "name": "Stamina",
      "description": "Physical energy that powers combat abilities and traversal techniques",
      "max_value": "20 + (Constitution modifier × 3) + (level × 3)",
      "regeneration": "2 per 6 seconds, +3 when in natural environments",
      "mechanics": [
        "Stamina points are spent to perform special combat maneuvers and traversal techniques",
        "Some abilities require maintaining focus, consuming stamina over time",
        "Resting in natural environments increases stamina regeneration rate by 400%",
        "Depleted stamina causes penalties to movement speed and attack rate",
        "Can channel stamina into enhanced mobility or combat techniques"
      ]
    },
    {
      "name": "Focus",
      "description": "Mental concentration that enhances awareness and precision",
      "max_value": "10 + (Wisdom modifier)",
      "regeneration": "2 per minute, additional points gained through successful tracking or hunting",
      "mechanics": [
        "Focus can be spent to enhance accuracy of attacks",
        "Can be used to heighten senses for tracking and detection",
        "Acts as a resource for nature magic abilities",
        "Maximum focus increases in familiar terrain",
        "Can be shared with animal companions to enhance their abilities"
      ]
    },
    {
      "name": "Nature's Blessing",
      "description": "Mystical connection to the natural world that grants special abilities",
      "max_value": "100",
      "regeneration": "Builds when in harmony with nature, decreases in corrupted or unnatural environments",
      "mechanics": [
        "Increases by 10 when helping to restore natural balance",
        "Increases by 5 per hour when in pristine wilderness",
        "Decreases by 10 when harming natural environments",
        "Decreases by 5 per hour when in heavily urbanized or corrupted areas",
        "Can be spent to commune with nature spirits or enhance nature-based abilities"
      ]
    }
  ],
  "class_mechanics": [
    {
      "name": "Enhanced Hunter's Mark",
      "description": "Advanced targeting that reveals critical weaknesses and enhances tracking",
      "effects": [
        "Marked targets take significantly more damage from your attacks",
        "Can track marked targets across any distance and through magical concealment",
        "Gain complete insight into marked target's weaknesses and resistances",
        "Successful attacks against marked targets restore moderate amounts of stamina",
        "Can maintain marks on multiple targets simultaneously"
      ]
    },
    {
      "name": "Wilderness Mastery",
      "description": "Unparalleled skill at navigating and surviving in any natural environment",
      "effects": [
        "Significantly increased movement speed in all natural environments",
        "Immunity to environmental hazards and weather effects",
        "Can create shelter, find food and water in even the most hostile environments",
        "Able to identify all natural features, plants, and animals with perfect accuracy",
        "Can temporarily alter terrain to create advantages in combat or travel"
      ]
    },
    {
      "name": "Advanced Favored Enemy",
      "description": "Comprehensive knowledge and specialized techniques against multiple enemy types",
      "effects": [
        "Greatly increased damage against all favored enemy types",
        "Can instantly identify weaknesses, resistances, and abilities of favored enemies",
        "Knowledge of advanced tactics against specific creature types",
        "Can share knowledge of favored enemies with allies, granting them bonuses",
        "Presence causes unease in favored enemy types, reducing their combat effectiveness"
      ]
    },
    {
      "name": "Nature Communion",
      "description": "Mystical connection with the natural world that grants special insights and abilities",
      "effects": [
        "Can communicate with plants and natural features to gather information",
        "Able to sense disturbances in the natural order across great distances",
        "Can temporarily borrow aspects of animals (keen senses, claws, etc.)",
        "Presence encourages natural healing and growth in damaged environments",
        "Can call upon nature spirits for assistance in times of need"
      ]
    }
  ],
  "skill_trees": [
    {
      "name": "Master Hunter",
      "focus": "Advanced combat techniques and prey exploitation",
      "key_abilities": [
        "Perfect Shot: Guaranteed critical hit that ignores armor",
        "Exploit Vital Points: Target specific body parts for devastating effects",
        "Volley: Rain arrows down on an area, hitting all enemies within"
      ]
    },
    {
      "name": "Wayfinder",
      "focus": "Advanced navigation and environmental manipulation",
      "key_abilities": [
        "Ghost Step: Move without leaving any trace of passage",
        "Nature's Path: Create temporary paths through otherwise impassable terrain",
        "Environmental Awareness: Gain perfect knowledge of surroundings within 100 meters"
      ]
    },
    {
      "name": "Beast Lord",
      "focus": "Enhanced animal companionship and nature magic",
      "key_abilities": [
        "Greater Animal Companion: Bond with multiple animals or a more powerful beast",
        "Wild Shape: Temporarily transform into an animal form",
        "Nature's Wrath: Channel natural energy into devastating attacks"
      ]
    }
  ],
  "advancement_requirements": {
    "level": 10,
    "quests": ["Trial of the Wild", "Communion with the Ancient Grove"],
    "skill_points": "At least 5 points in any ranger skill tree",
    "challenges": ["Track and hunt a legendary beast", "Survive alone in the wilderness for 7 days"]
  },
  "progression_path": {
    "hero_classes": [
      {
        "id": "warder",
        "name": "Warder",
        "alignment": "Good",
        "level_requirement": 30,
        "description": "Pathfinders who have formed deep spiritual bonds with the natural world, becoming guardians of wilderness and protectors of the balance between civilization and nature."
      },
      {
        "id": "stalker",
        "name": "Stalker",
        "alignment": "Neutral",
        "level_requirement": 30,
        "description": "Pathfinders who have perfected the art of tracking and hunting, becoming unparalleled hunters who can pursue any prey through any terrain with relentless efficiency."
      },
      {
        "id": "outrider",
        "name": "Outrider",
        "alignment": "Evil",
        "level_requirement": 30,
        "description": "Pathfinders who have embraced the role of merciless frontier enforcers, using their unparalleled wilderness skills to hunt down enemies and control territory through fear and superior mobility."
      }
    ]
  },
  "legendary_items": [
    {
      "name": "Bow of the Wild Hunt",
      "type": "Weapon",
      "effects": [
        "Arrows fired from this bow never miss marked targets",
        "Enhanced Hunter's Mark damage increased by 30%",
        "Can fire arrows that transform into animals mid-flight to attack from multiple angles"
      ]
    },
    {
      "name": "Cloak of the Wilderness",
      "type": "Back",
      "effects": [
        "Grants perfect camouflage in natural environments",
        "Nature's Blessing regeneration increased by 50%",
        "Surroundings adapt to provide cover and concealment"
      ]
    }
  ],
  "lore": "Pathfinders represent rangers who have transcended the ordinary bounds of wilderness survival and tracking, developing a mystical connection with nature itself. Where ordinary rangers learn to live in harmony with the wild, Pathfinders become one with it, able to communicate with plants, commune with nature spirits, and navigate terrain that would be impassable to others. Their enhanced connection to the natural world grants them insights and abilities that seem magical to outsiders, allowing them to sense disturbances in the natural order across vast distances and temporarily borrow aspects of animals they've studied. Pathfinders often serve as guardians of ancient groves, protectors of endangered species, or guides through the most treacherous wilderness. Some dedicate themselves to restoring corrupted lands, while others focus on hunting creatures that threaten the natural balance. Their combat abilities are enhanced by their deeper understanding of prey behavior and anatomy, allowing them to target vital points with uncanny precision. Whether they choose to deepen their connection with animals, master the art of traversing impossible terrain, or turn their hunting skills toward darker purposes, all Pathfinders command respect from those who venture into the wild places of the world."
}
