{
  "id": "warrior",
  "name": "Warrior",
  "description": "Disciplined fighters who excel in physical combat, mastering weapons and martial techniques to overcome enemies through strength, skill, and tactical prowess.",
  "level_requirement": 1,
  "role": "Tank-Damage",
  "primary_stats": ["Strength", "Constitution"],
  "secondary_stats": ["Dexterity", "Wisdom"],
  "resource_systems": [
    {
      "name": "Stamina",
      "description": "Physical energy that powers combat abilities and martial techniques",
      "max_value": "20 + (Constitution modifier × 5) + (level × 5)",
      "regeneration": "3 per 6 seconds, +5 during combat",
      "mechanics": [
        "Stamina points are spent to perform special combat maneuvers and martial techniques",
        "Some abilities require maintaining focus, consuming stamina over time",
        "Short rests restore a portion of maximum stamina",
        "Depleted stamina causes penalties to attack speed and defensive capabilities",
        "Can be temporarily boosted through adrenaline in critical situations",
        "Successful combat maneuvers can restore a portion of stamina"
      ]
    },
    {
      "name": "Combat Focus",
      "description": "Mental concentration and battlefield awareness that enhances combat effectiveness",
      "max_value": "100",
      "regeneration": "Builds during combat, decreases during periods of inaction",
      "mechanics": [
        "Increases by 10 when landing critical hits or successfully executing combat maneuvers",
        "Increases by 5 per 10 seconds in active combat",
        "Decreases by 10 when taking significant damage or being stunned",
        "Decreases by 5 per minute when out of combat",
        "Can be spent to enhance combat abilities or execute special techniques",
        "Higher Combat Focus increases critical hit chance and defensive reactions"
      ]
    }
  ],
  "class_mechanics": [
    {
      "name": "Weapon Mastery",
      "description": "Exceptional skill with a wide variety of weapons",
      "effects": [
        "Can effectively use any conventional weapon with minimal training",
        "Able to identify optimal weapons for specific combat situations",
        "Can maintain and repair weapons with basic materials",
        "Presence naturally intimidates less skilled combatants",
        "Can analyze and counter enemy fighting styles through weapon techniques"
      ]
    },
    {
      "name": "Combat Expertise",
      "description": "Comprehensive understanding of combat tactics and techniques",
      "effects": [
        "Can quickly assess combat situations and identify tactical advantages",
        "Able to adapt fighting style to counter specific opponents",
        "Can predict enemy movements and attacks with increased accuracy",
        "Presence enhances the combat effectiveness of allies",
        "Can identify and exploit weaknesses in enemy defenses"
      ]
    },
    {
      "name": "Physical Conditioning",
      "description": "Superior physical strength, endurance, and toughness",
      "effects": [
        "Can endure physical hardship and continue fighting despite injuries",
        "Able to perform feats of strength beyond normal human capabilities",
        "Can maintain peak combat performance for extended periods",
        "Presence projects an aura of physical power and capability",
        "Can recover from injuries and fatigue more quickly than others"
      ]
    },
    {
      "name": "Battlefield Awareness",
      "description": "Enhanced perception and understanding of combat environments",
      "effects": [
        "Can quickly assess terrain and environmental factors for tactical advantage",
        "Able to maintain awareness of multiple opponents simultaneously",
        "Can identify potential threats and ambush points in any environment",
        "Presence improves the tactical positioning of nearby allies",
        "Can anticipate and counter battlefield hazards and complications"
      ]
    }
  ],
  "skill_trees": [
    {
      "name": "Weapon Specialist",
      "focus": "Mastery of specific weapon types and techniques",
      "key_abilities": [
        "Weapon Expertise: Gain significant bonuses with chosen weapon types",
        "Combat Techniques: Master specialized attacks and maneuvers",
        "Weapon Versatility: Switch between different weapons with no penalty"
      ]
    },
    {
      "name": "Battlefield Tactician",
      "focus": "Combat strategy and tactical advantage",
      "key_abilities": [
        "Tactical Advantage: Identify and exploit weaknesses in enemy formations",
        "Combat Awareness: Maintain perfect battlefield awareness in chaotic situations",
        "Strategic Positioning: Control the flow of battle through superior positioning"
      ]
    },
    {
      "name": "Combat Specialist",
      "focus": "Advanced combat techniques and physical prowess",
      "key_abilities": [
        "Combat Mastery: Execute perfect attacks and defenses in any situation",
        "Physical Dominance: Overwhelm opponents with superior strength and endurance",
        "Battle Hardened: Resist and recover from injuries with exceptional speed"
      ]
    }
  ],
  "progression_path": {
    "arch_classes": [
      {
        "id": "battlemaster",
        "name": "Battlemaster",
        "level_requirement": 10,
        "description": "Warriors who have refined their combat skills to become elite battlefield commanders, combining personal martial prowess with tactical leadership."
      }
    ]
  },
  "lore": "Warriors represent the pinnacle of martial combat, having dedicated their lives to mastering the art of warfare in all its forms. Unlike the mystical powers of mages or the divine blessings of clerics, warriors rely on physical prowess, combat training, and tactical acumen to overcome challenges. Their training encompasses not just weapon skills and fighting techniques but also battlefield tactics, physical conditioning, and mental discipline, making them versatile combatants in any conflict. Many warriors begin their careers in military organizations or martial academies, where they can develop their skills under experienced instructors. Others are self-taught fighters who developed their abilities through necessity or natural talent. Regardless of their background, all warriors share a respect for discipline, preparation, and the practical application of combat skills. In dangerous situations, warriors excel at controlling the battlefield through superior positioning and tactical awareness, adapting their approach to counter specific threats and protect vulnerable allies. Their ability to endure physical hardship and continue fighting despite injuries makes them reliable front-line combatants in extended conflicts. Though they may lack the flashy abilities of more magical classes, the consistent effectiveness and tactical versatility of warriors often prove decisive in challenging encounters where skill and discipline triumph over raw power."
}
