{
  "id": "rake",
  "name": "Rake",
  "base_class": "thief",
  "description": "Thieves who have refined their skills to become elite infiltrators and manipulators, combining stealth with social cunning and specialized techniques to accomplish seemingly impossible heists and operations.",
  "level_requirement": 10,
  "role": "DPS-Control",
  "primary_stats": ["Dexterity", "Charisma"],
  "secondary_stats": ["Intelligence", "Wisdom"],
  "resource_systems": [
    {
      "name": "Energy",
      "description": "Physical energy that powers stealth abilities and precision strikes",
      "max_value": "30 + (Dexterity modifier × 6) + (level × 6)",
      "regeneration": "4 per 6 seconds, +7 when in stealth or during social manipulation",
      "mechanics": [
        "Energy points are spent to perform special stealth maneuvers and precision attacks",
        "Some abilities require maintaining focus, consuming energy over time",
        "Short rests restore a significant portion of maximum energy",
        "Depleted energy causes penalties to stealth and attack speed",
        "Can be temporarily boosted through adrenaline in critical situations",
        "Successful stealth kills or social manipulations restore a portion of energy"
      ]
    },
    {
      "name": "Cunning",
      "description": "Mental acuity and tactical awareness that enhances deception and exploitation of weaknesses",
      "max_value": "150",
      "regeneration": "Builds when successfully using stealth, social manipulation, or exploiting weaknesses",
      "mechanics": [
        "Increases by 15 when successfully picking locks, disarming traps, or manipulating targets",
        "Increases by 20 when landing critical strikes from stealth or executing perfect heists",
        "Decreases by 15 when detected during stealth or when social deceptions fail",
        "Decreases by 20 when failing to pick locks or disarm traps",
        "Can be spent to enhance stealth abilities or execute precision strikes",
        "Higher Cunning increases critical hit chance, damage, and social manipulation success"
      ]
    },
    {
      "name": "Infamy",
      "description": "Reputation and notoriety that can be leveraged for intimidation or respect",
      "max_value": "100",
      "regeneration": "Builds when successfully completing difficult heists or manipulations",
      "mechanics": [
        "Increases by 10 when completing challenging heists or infiltrations",
        "Increases by 5 when successfully manipulating high-value targets",
        "Decreases by 10 when failing publicly or being captured",
        "Decreases by 5 when reputation is questioned or undermined",
        "Can be spent to intimidate enemies or impress potential allies",
        "Higher Infamy increases the effectiveness of social abilities and reputation-based skills"
      ]
    }
  ],
  "class_mechanics": [
    {
      "name": "Advanced Shadow Mastery",
      "description": "Superior ability to move unseen and manipulate shadows",
      "effects": [
        "Can move silently at full speed across any surface",
        "Able to hide in plain sight with virtually no cover",
        "Significantly reduced visibility to detection abilities and magical senses",
        "Can manipulate shadows to create distractions or temporary concealment",
        "Presence can dim lights in a wider area, creating advantageous conditions"
      ]
    },
    {
      "name": "Social Engineering",
      "description": "Expert manipulation of social dynamics and individual psychology",
      "effects": [
        "Can quickly assess personalities and motivations of targets",
        "Able to craft convincing personas and backstories on the fly",
        "Can manipulate social situations to create opportunities or distractions",
        "Gains significant advantages in negotiations and interrogations",
        "Can plant suggestions that targets believe are their own ideas"
      ]
    },
    {
      "name": "Advanced Precision",
      "description": "Masterful knowledge of vulnerabilities and precision techniques",
      "effects": [
        "Greatly increased critical hit chance and damage",
        "Can target specific vulnerabilities for debilitating effects",
        "Able to disable rather than kill with perfect precision",
        "Can analyze and exploit structural weaknesses in objects and environments",
        "Attacks can bypass a portion of armor and magical protections"
      ]
    },
    {
      "name": "Heist Mastery",
      "description": "Comprehensive expertise in planning and executing complex operations",
      "effects": [
        "Can quickly case locations to identify security measures and valuables",
        "Able to formulate effective infiltration plans with minimal information",
        "Can improvise solutions to unexpected complications during operations",
        "Gains advantages when coordinating with allies during heists",
        "Can identify the most valuable targets and optimal extraction routes"
      ]
    }
  ],
  "skill_trees": [
    {
      "name": "Master Infiltrator",
      "focus": "Advanced stealth and security bypassing",
      "key_abilities": [
        "Ghost: Move without leaving any trace of your presence",
        "Security Specialist: Bypass even magical and planar security systems",
        "Perfect Timing: Identify and exploit patterns in guard rotations and security systems"
      ]
    },
    {
      "name": "Social Manipulator",
      "focus": "Deception and social engineering",
      "key_abilities": [
        "Perfect Disguise: Completely assume another's identity, including mannerisms",
        "Silver Tongue: Convince others to believe even implausible deceptions",
        "Psychological Manipulation: Identify and exploit emotional vulnerabilities"
      ]
    },
    {
      "name": "Shadow Operative",
      "focus": "Combining stealth with precision strikes",
      "key_abilities": [
        "Shadow Strike: Attack from stealth with devastating precision",
        "Vanish: Disappear from sight even when being directly observed",
        "Exploit Vulnerability: Identify and target critical weaknesses for maximum effect"
      ]
    }
  ],
  "advancement_requirements": {
    "level": 10,
    "quests": ["The Perfect Heist", "Infiltration of a Secure Facility"],
    "skill_points": "At least 5 points in any thief skill tree",
    "challenges": ["Successfully complete a complex heist without being detected", "Master advanced lockpicking and trap disarming"]
  },
  "progression_path": {
    "hero_classes": [
      {
        "id": "arcane_trickster",
        "name": "Arcane Trickster",
        "alignment": "Good",
        "level_requirement": 30,
        "description": "Rakes who have incorporated arcane magic into their repertoire, using illusions and enchantments to further their goals while maintaining a code of honor."
      },
      {
        "id": "shadowblade",
        "name": "Shadowblade",
        "alignment": "Neutral",
        "level_requirement": 30,
        "description": "Rakes who have mastered the manipulation of shadows and stealth, becoming one with the darkness to strike with lethal precision."
      },
      {
        "id": "blackguard",
        "name": "BlackGuard",
        "alignment": "Evil",
        "level_requirement": 30,
        "description": "Rakes who have embraced darker powers and ruthless methods, combining stealth with intimidation and cruelty to achieve their goals."
      }
    ]
  },
  "legendary_items": [
    {
      "name": "Skeleton Keys",
      "type": "Tool",
      "effects": [
        "Can open any non-magical lock with a single attempt",
        "Provides significant bonuses when attempting to bypass magical locks",
        "Can be used to temporarily disable magical wards and barriers"
      ]
    },
    {
      "name": "Cloak of Shadows",
      "type": "Back",
      "effects": [
        "Enhances stealth abilities, making the wearer nearly invisible in shadows",
        "Can manipulate nearby shadows to create distractions or concealment",
        "Provides resistance to detection magic and scrying attempts"
      ]
    }
  ],
  "lore": "Rakes represent thieves who have elevated their craft from simple burglary to an art form, combining exceptional stealth abilities with social manipulation and precise planning. Where ordinary thieves might rely on opportunity and basic skills, Rakes approach their operations with meticulous preparation, psychological insight, and a comprehensive understanding of security systems both mundane and magical. The path to becoming a Rake often involves apprenticeship under a master or membership in an elite thieves' guild, though some exceptional individuals develop their skills independently through years of increasingly ambitious operations. Those who succeed find themselves capable of accomplishing heists and infiltrations that others would consider impossible, earning both notoriety among authorities and respect among their peers. Rakes serve various roles in society, from independent operators who select their own targets to guild specialists who handle the most challenging aspects of group operations. Some focus on acquiring specific high-value items for collectors or recovering lost artifacts, while others specialize in gathering intelligence or manipulating social situations to create opportunities for themselves or their allies. Their combination of stealth, social skills, and tactical thinking makes them versatile operatives who can adapt to unexpected complications during missions. Though they may lack the raw combat power of warriors or the magical versatility of spellcasters, the ability of Rakes to bypass obstacles, gather critical information, and strike from unexpected angles makes them invaluable in complex operations where brute force would fail."
}
