{
  "id": "thief",
  "name": "Thief",
  "description": "Masters of stealth, deception, and precision who excel at infiltration, disarming traps, and exploiting enemy weaknesses through cunning rather than brute force.",
  "level_requirement": 1,
  "role": "DPS-Utility",
  "primary_stats": ["Dexterity", "Intelligence"],
  "secondary_stats": ["Charisma", "Wisdom"],
  "resource_systems": [
    {
      "name": "Energy",
      "description": "Physical energy that powers stealth abilities and precision strikes",
      "max_value": "20 + (Dexterity modifier × 5) + (level × 5)",
      "regeneration": "3 per 6 seconds, +5 when in stealth",
      "mechanics": [
        "Energy points are spent to perform special stealth maneuvers and precision attacks",
        "Some abilities require maintaining focus, consuming energy over time",
        "Short rests restore a portion of maximum energy",
        "Depleted energy causes penalties to stealth and attack speed",
        "Can be temporarily boosted through adrenaline in critical situations",
        "Successful stealth kills restore a portion of energy"
      ]
    },
    {
      "name": "Cunning",
      "description": "Mental acuity and tactical awareness that enhances deception and exploitation of weaknesses",
      "max_value": "100",
      "regeneration": "Builds when successfully using stealth or exploiting weaknesses, decreases when detected",
      "mechanics": [
        "Increases by 10 when successfully picking locks or disarming traps",
        "Increases by 15 when landing critical strikes from stealth",
        "Decreases by 10 when detected during stealth",
        "Decreases by 15 when failing to pick locks or disarm traps",
        "Can be spent to enhance stealth abilities or execute precision strikes",
        "Higher Cunning increases critical hit chance and damage"
      ]
    }
  ],
  "class_mechanics": [
    {
      "name": "Shadow Mastery",
      "description": "Exceptional ability to move unseen and unheard",
      "effects": [
        "Can move silently even across noisy surfaces",
        "Able to hide in plain sight with minimal cover",
        "Reduced visibility to detection abilities and magical senses",
        "Can track movement patterns to predict optimal moments for stealth",
        "Presence naturally dims lights in the immediate vicinity"
      ]
    },
    {
      "name": "Precision Strikes",
      "description": "Knowledge of vital points and weaknesses in defenses",
      "effects": [
        "Increased critical hit chance and damage",
        "Able to identify and exploit weaknesses in enemy armor and defenses",
        "Can target specific body parts for tactical advantages",
        "Attacks have a chance to apply debilitating effects",
        "Can analyze enemy fighting styles to predict and counter movements"
      ]
    },
    {
      "name": "Trap Expertise",
      "description": "Skill at detecting, disarming, and setting traps",
      "effects": [
        "Can detect hidden traps and mechanisms with heightened perception",
        "Able to disarm complex mechanical and magical traps",
        "Can set improvised traps using available materials",
        "Gains tactical advantages when fighting in trapped areas",
        "Can analyze security systems to identify vulnerabilities"
      ]
    },
    {
      "name": "Deception",
      "description": "Mastery of lies, disguise, and misdirection",
      "effects": [
        "Can convincingly impersonate others with minimal preparation",
        "Able to detect lies and hidden intentions in conversations",
        "Can create distractions to divert attention",
        "Gains advantages when using feints and misdirection in combat",
        "Can plant false information or evidence with convincing authenticity"
      ]
    }
  ],
  "skill_trees": [
    {
      "name": "Shadow Walker",
      "focus": "Stealth and evasion",
      "key_abilities": [
        "Perfect Stealth: Become nearly invisible even when moving",
        "Shadow Step: Move silently at increased speed",
        "Evasion: Automatically avoid area effects and traps"
      ]
    },
    {
      "name": "Infiltrator",
      "focus": "Breaking and entering, trap handling",
      "key_abilities": [
        "Master Lockpick: Open even the most complex locks with ease",
        "Trap Sense: Automatically detect nearby traps and mechanisms",
        "Security Expert: Bypass magical and mechanical security systems"
      ]
    },
    {
      "name": "Backstabber",
      "focus": "Precision damage and critical strikes",
      "key_abilities": [
        "Vital Strike: Target critical vulnerabilities for massive damage",
        "Exploit Weakness: Identify and target enemy weaknesses",
        "Assassinate: Deal devastating damage to unaware targets"
      ]
    }
  ],
  "progression_path": {
    "arch_classes": [
      {
        "id": "rake",
        "name": "Rake",
        "level_requirement": 10,
        "description": "Thieves who have refined their skills to become elite infiltrators and manipulators, combining stealth with social cunning and specialized techniques."
      }
    ]
  },
  "lore": "Thieves represent the shadowy counterpart to conventional warriors, relying on stealth, precision, and cunning rather than brute force to overcome challenges. Unlike the mystical powers of mages or the divine blessings of clerics, thieves depend on honed skills, quick wits, and intimate knowledge of their targets' vulnerabilities. Their training encompasses not just picking locks and disarming traps but also the arts of deception, disguise, and psychological manipulation, making them versatile operatives in any situation requiring subtlety. Many thieves begin their careers in urban environments, where the complex architecture and social hierarchies provide ample opportunities to develop their unique skill set. Some are formally trained in thieves' guilds or espionage organizations, while others are self-taught survivors who developed their abilities out of necessity. Regardless of their background, all thieves share an appreciation for precision, preparation, and the value of information. In dangerous situations, thieves excel at controlling the battlefield through stealth and misdirection, striking at critical moments and disappearing before enemies can effectively respond. Their ability to bypass obstacles, disable traps, and access restricted areas makes them invaluable members of any adventuring party, opening paths that would be impossible for more direct approaches. Though they may lack the raw power of more combat-focused classes, the versatility and tactical advantages provided by thieves often prove decisive in complex encounters."
}
