{
  "id": "bard",
  "name": "Bard",
  "description": "Masters of rhythm and resonance, Bards rotate powerful melodies that enhance allies, debilitate enemies, or shift the battlefield. With instant shouts and a blend of control and mobility, they thrive through versatility.",
  "role": "utility-control",
  "primary_stats": ["cha", "agi"],
  "secondary_stats": ["int", "dex"],
  "resources": ["focus"],
  "resource_mechanics": {
    "focus": {
      "description": "A measure of the Bard's concentration and performance energy",
      "base_amount": 100,
      "regeneration": "5 per second while not performing, none while performing",
      "max_amount_formula": "100 + (CHA * 5) + (level * 10)"
    }
  },
  "armor_proficiency": ["cloth", "light"],
  "weapon_proficiency": ["daggers", "swords", "bows", "musical_instruments"],
  "starting_equipment": {
    "weapons": ["lute", "dagger"],
    "armor": ["performer's_outfit"],
    "accessories": ["traveler's_pack", "sheet_music"]
  },
  "class_mechanics": {
    "performance": {
      "description": "Bards can perform songs that provide continuous effects while maintained",
      "cost": "5 Focus per second",
      "limitations": "Only one performance can be active at a time",
      "scaling": "Effect potency scales with Charisma and Performance skill"
    },
    "shouts": {
      "description": "Instant vocal abilities that provide immediate effects",
      "cost": "Varies by shout (25-50 Focus)",
      "cooldown": "Varies by shout (8-30 seconds)",
      "scaling": "Effect potency scales with Charisma and level"
    },
    "inspiration": {
      "description": "Bards can inspire allies, granting them bonuses to their next action",
      "cost": "35 Focus",
      "cooldown": "45 seconds",
      "effect": "Target ally gains +15% to their next ability or attack",
      "scaling": "Bonus increases by 1% per point of Charisma above 15"
    }
  },
  "skill_trees": [
    {
      "name": "Harmony",
      "focus": "Support and healing through music",
      "key_abilities": [
        "Healing Melody: A continuous performance that heals allies within 30 feet",
        "Energizing Chorus: Increases resource regeneration for all allies",
        "Protective Verse: Grants damage reduction to nearby allies"
      ]
    },
    {
      "name": "Discord",
      "focus": "Debuffs and control through dissonant sounds",
      "key_abilities": [
        "Disorienting Noise: Confuses enemies, causing them to attack randomly",
        "Painful Frequencies: Continuous damage to all enemies in range",
        "Silencing Screech: Prevents enemies from casting spells"
      ]
    },
    {
      "name": "Virtuoso",
      "focus": "Personal combat enhancement through musical mastery",
      "key_abilities": [
        "Battle Rhythm: Increases attack and movement speed",
        "Deflecting Notes: Parries incoming attacks while performing",
        "Encore: Allows immediate reuse of a previously used ability"
      ]
    }
  ],
  "racial_affinities": {
    "elf": {
      "bonus": "Performances cost 10% less Focus",
      "special_ability": "Elven Harmony: Can maintain performances 25% longer"
    },
    "human": {
      "bonus": "+5% effectiveness to all Shout abilities",
      "special_ability": "Versatile Voice: Cooldowns on Shouts reduced by 10%"
    },
    "gnome": {
      "bonus": "+10% to all control effects",
      "special_ability": "Tricky Tunes: Discord abilities have a 15% chance to apply twice"
    }
  },
  "playstyle": "Bards excel at supporting allies while controlling enemies through their performances. They must balance their Focus resource between sustained performances and powerful shout abilities. Positioning is crucial, as most abilities affect targets in an area around the Bard. The class rewards creative thinking and tactical awareness, allowing players to adapt to changing battlefield conditions.",
  "difficulty": "Medium - Requires good resource management and positioning",
  "recommended_for": "Players who enjoy support roles with offensive capabilities and tactical flexibility"
}
