{
  "id": "master",
  "name": "Master",
  "base_class": "monk",
  "description": "Monks who have achieved perfect harmony between body and spirit, capable of extraordinary physical and spiritual feats beyond the capabilities of ordinary martial artists.",
  "level_requirement": 10,
  "role": "Mobility-Control",
  "primary_stats": ["Dexterity", "Wisdom"],
  "secondary_stats": ["Strength", "Constitution"],
  "resource_systems": [
    {
      "name": "Ki",
      "description": "Inner spiritual energy that powers martial techniques and supernatural abilities",
      "max_value": "20 + (Wisdom modifier × 3) + (level × 3)",
      "regeneration": "2 per 6 seconds, +2 per successful melee attack combo finisher",
      "mechanics": [
        "Ki points are spent to activate special abilities and techniques",
        "Some abilities require maintaining a ki flow, consuming points over time",
        "Meditation stance increases ki regeneration rate by 400% but prevents movement",
        "Masters can channel ki into elemental manifestations"
      ]
    },
    {
      "name": "Focus",
      "description": "Mental concentration that enhances precision and power of techniques",
      "max_value": "150",
      "regeneration": "Builds during combat, decays when out of combat",
      "mechanics": [
        "Increases by 8 when landing attacks, 15 for critical hits",
        "Decreases by 1 per second when not in combat",
        "Higher Focus increases critical hit chance and damage of special techniques",
        "At 100+ Focus, gain access to Transcendent techniques"
      ]
    },
    {
      "name": "Harmony",
      "description": "Balance between physical prowess and spiritual enlightenment",
      "max_value": "100",
      "regeneration": "Builds by alternating between offensive and defensive actions",
      "mechanics": [
        "Increases by 10 when switching from attack to defense or vice versa",
        "Decreases by 5 per 10 seconds",
        "Higher Harmony increases all damage and damage reduction",
        "At maximum Harmony, can enter Enlightened State for 30 seconds"
      ]
    }
  ],
  "class_mechanics": [
    {
      "name": "Advanced Martial Arts",
      "description": "Mastery of unarmed combat that transcends normal physical limitations",
      "effects": [
        "Unarmed attacks deal 2d8 base damage (increases with level)",
        "Attack speed with unarmed strikes is 35% faster than standard weapons",
        "Critical hits with unarmed attacks have a 40% chance to stun the target for 2 seconds",
        "Can attack ethereal and incorporeal enemies with unarmed strikes"
      ]
    },
    {
      "name": "Flowing Mastery",
      "description": "Perfect control over combat flow and rhythm",
      "effects": [
        "Each consecutive hit on the same target increases damage by 12%",
        "After 3 consecutive hits, gain access to enhanced combo finishers",
        "Combo counter resets after 5 seconds without landing an attack",
        "Can maintain multiple combo chains against different targets simultaneously"
      ]
    },
    {
      "name": "Spiritual Transcendence",
      "description": "Elevated spiritual connection that grants supernatural abilities",
      "effects": [
        "Can sense invisible or hidden enemies within 50 meters",
        "Immune to fear, charm, and mind control effects",
        "Can enter deep meditation to rapidly restore ki, health, and cleanse debuffs",
        "Can project consciousness to scout areas within 100 meters"
      ]
    },
    {
      "name": "Elemental Fist",
      "description": "Channel elemental energies through martial techniques",
      "effects": [
        "Can imbue attacks with fire, ice, lightning, or earth damage",
        "Elemental attacks apply corresponding status effects",
        "Can create elemental barriers for protection",
        "Switching elements builds Harmony faster"
      ]
    }
  ],
  "skill_trees": [
    {
      "name": "Way of the Grandmaster",
      "focus": "Perfect technique and combat mastery",
      "key_abilities": [
        "Perfect Strike: Guaranteed critical hit that ignores armor",
        "Hundred Palm Technique: Unleash a flurry of 100 strikes in an instant",
        "Touch of Death: Channel ki into a single deadly strike that can instantly kill weaker enemies"
      ]
    },
    {
      "name": "Way of the Ascendant",
      "focus": "Spiritual enlightenment and supernatural abilities",
      "key_abilities": [
        "Astral Projection: Temporarily separate spirit from body to travel unhindered",
        "Enlightened State: Enter a state of perfect harmony for enhanced abilities",
        "Healing Touch: Channel ki to heal allies or cleanse corruption"
      ]
    },
    {
      "name": "Way of the Elements",
      "focus": "Elemental ki manipulation",
      "key_abilities": [
        "Elemental Convergence: Combine multiple elements for devastating attacks",
        "Dragon's Breath: Channel elemental ki into a powerful cone attack",
        "Elemental Immunity: Temporarily become immune to a chosen element"
      ]
    }
  ],
  "advancement_requirements": {
    "level": 10,
    "quests": ["Path to Mastery", "Trial of the Four Elements"],
    "skill_points": "At least 5 points in any monk skill tree",
    "challenges": ["Defeat the Monastery Guardian without taking damage"]
  },
  "progression_path": {
    "hero_classes": [
      {
        "id": "enlightened_master",
        "name": "Enlightened Master",
        "alignment": "Good",
        "level_requirement": 30,
        "description": "Monks who have achieved spiritual enlightenment and use their abilities to protect and guide others."
      },
      {
        "id": "iron_fist_master",
        "name": "Iron Fist Master",
        "alignment": "Neutral",
        "level_requirement": 30,
        "description": "Monks who have perfected the art of combat through discipline and training."
      },
      {
        "id": "way_of_shadow",
        "name": "Way of Shadow",
        "alignment": "Evil",
        "level_requirement": 30,
        "description": "Monks who have turned their mastery of ki toward darker purposes, becoming deadly assassins."
      }
    ]
  },
  "legendary_items": [
    {
      "name": "Gloves of the Grandmaster",
      "type": "Handwraps",
      "effects": [
        "Increases unarmed damage by 25%",
        "Reduces ki cost of all abilities by 15%",
        "Grants an additional combo finisher option"
      ]
    },
    {
      "name": "Sash of the Four Winds",
      "type": "Belt",
      "effects": [
        "Increases movement speed by 20%",
        "Grants immunity to movement-impairing effects",
        "Allows short-range teleportation once per minute"
      ]
    }
  ],
  "lore": "Masters are monks who have transcended the limitations of ordinary martial artists through years of rigorous training and spiritual discipline. They have achieved a perfect harmony between body and spirit, allowing them to perform feats that seem impossible to the uninitiated. Masters can channel their ki into elemental manifestations, move with supernatural speed, and strike with devastating precision. Some dedicate their abilities to protecting the innocent and spreading wisdom, while others focus solely on perfecting their combat techniques or even using their powers for darker purposes. Regardless of their path, all Masters command respect and awe from those who witness their extraordinary abilities."
}
