{
  "id": "monk",
  "name": "Monk",
  "description": "Disciplined martial artists who harness their inner ki energy to perform extraordinary physical feats and spiritual techniques.",
  "level_requirement": 1,
  "role": "Mobility-Control",
  "primary_stats": ["Dexterity", "Wisdom"],
  "secondary_stats": ["Strength", "Constitution"],
  "resource_systems": [
    {
      "name": "Ki",
      "description": "Inner spiritual energy that powers martial techniques and supernatural abilities",
      "max_value": "10 + (Wisdom modifier × 2) + (level × 2)",
      "regeneration": "1 per 6 seconds, +1 per successful melee attack combo finisher",
      "mechanics": [
        "Ki points are spent to activate special abilities and techniques",
        "Some abilities require maintaining a ki flow, consuming points over time",
        "Meditation stance increases ki regeneration rate by 300% but prevents movement"
      ]
    },
    {
      "name": "Focus",
      "description": "Mental concentration that enhances precision and power of techniques",
      "max_value": "100",
      "regeneration": "Builds during combat, decays when out of combat",
      "mechanics": [
        "Increases by 5 when landing attacks, 10 for critical hits",
        "Decreases by 2 per second when not in combat",
        "Higher Focus increases critical hit chance and damage of special techniques"
      ]
    }
  ],
  "class_mechanics": [
    {
      "name": "Martial Arts",
      "description": "Specialized unarmed combat training that increases damage and attack speed",
      "effects": [
        "Unarmed attacks deal 1d8 base damage (increases with level)",
        "Attack speed with unarmed strikes is 20% faster than standard weapons",
        "Critical hits with unarmed attacks have a 25% chance to stun the target for 1 second"
      ]
    },
    {
      "name": "Flowing Strikes",
      "description": "Chain attacks into powerful combinations with increasing effectiveness",
      "effects": [
        "Each consecutive hit on the same target increases damage by 8%",
        "After 3 consecutive hits, gain access to combo finishers",
        "Combo counter resets after 3 seconds without landing an attack"
      ]
    },
    {
      "name": "Spiritual Attunement",
      "description": "Connection to spiritual energies that grants supernatural abilities",
      "effects": [
        "Can sense invisible or hidden enemies within 20 meters",
        "Immune to fear and charm effects while above 50% ki",
        "Can enter meditation to rapidly restore ki and health"
      ]
    }
  ],
  "skill_trees": [
    {
      "name": "Way of the Open Hand",
      "focus": "Precise strikes and pressure point techniques",
      "key_abilities": [
        "Palm Strike: Powerful forward strike that can push enemies back",
        "Pressure Point Strike: Target vital points to temporarily disable enemy abilities",
        "Stunning Fist: Concentrate ki into a powerful blow that can stun enemies"
      ]
    },
    {
      "name": "Way of the Iron Body",
      "focus": "Physical conditioning and defensive techniques",
      "key_abilities": [
        "Iron Skin: Temporarily harden body to reduce incoming damage",
        "Deflecting Palm: Redirect incoming projectiles back at attackers",
        "Rooted Stance: Become immovable and immune to knockback effects"
      ]
    },
    {
      "name": "Way of the Spirit",
      "focus": "Ki manipulation and spiritual techniques",
      "key_abilities": [
        "Spirit Step: Short-range teleportation using ki energy",
        "Ki Blast: Project ki energy as a damaging force",
        "Healing Meditation: Channel ki to rapidly restore health"
      ]
    }
  ],
  "racial_affinities": [
    {
      "race": "Human",
      "bonuses": [
        "Increased Focus generation rate by 15%",
        "Additional combo finisher option at level 5"
      ]
    },
    {
      "race": "Elf",
      "bonuses": [
        "Ki regeneration increased by 20%",
        "Spirit techniques cost 10% less ki"
      ]
    },
    {
      "race": "Dwarf",
      "bonuses": [
        "Iron Body techniques are 15% more effective",
        "Gain 10% damage reduction while above 50% ki"
      ]
    }
  ],
  "progression_path": {
    "arch_classes": [
      {
        "id": "master",
        "name": "Master",
        "description": "Monks who have achieved perfect harmony between body and spirit, capable of extraordinary physical and spiritual feats.",
        "level_requirement": 10,
        "skill_requirements": [
          "At least 5 points in any monk skill tree",
          "Completion of the 'Path to Mastery' quest"
        ]
      }
    ]
  },
  "starting_equipment": [
    "Simple cloth robes",
    "Training wraps for hands and feet",
    "Meditation beads",
    "Walking staff",
    "Small pouch of medicinal herbs"
  ],
  "lore": "Monks are disciplined warriors who train their bodies and minds to achieve extraordinary physical and spiritual capabilities. Through rigorous training and meditation, they learn to harness their inner ki energy, allowing them to perform feats that seem supernatural to the untrained eye. Monasteries throughout the world teach different philosophies and fighting styles, but all monks share a commitment to self-improvement and the pursuit of perfection. Whether they follow the path of the peaceful ascetic or the disciplined warrior, monks rely on their own bodies as weapons and their inner strength as a source of power."
}
