{
  "id": "fateweaver",
  "name": "Fateweaver",
  "base_class": "oracle",
  "description": "Oracles who have mastered the manipulation of destiny and can weave the threads of fate to create powerful effects that alter reality itself.",
  "level_requirement": 10,
  "role": "Support-Control",
  "primary_stats": ["Wisdom", "Charisma"],
  "secondary_stats": ["Intelligence", "Constitution"],
  "resource_systems": [
    {
      "name": "Mana",
      "description": "Mystical energy that powers divination spells and prophecies",
      "max_value": "20 + (Wisdom modifier × 3) + (level × 3)",
      "regeneration": "2 per 6 seconds, +3 when successfully predicting an event",
      "mechanics": [
        "Mana points are spent to cast divination spells and invoke prophecies",
        "Some abilities require maintaining a connection to the future, consuming mana over time",
        "Meditation increases mana regeneration rate by 400% but prevents movement",
        "Can channel mana into fate threads to strengthen destiny manipulation"
      ]
    },
    {
      "name": "Fate Points",
      "description": "Accumulated knowledge of possible futures that can be spent to alter destiny",
      "max_value": "5 + (Wisdom modifier)",
      "regeneration": "2 per long rest, additional points gained through significant divinations",
      "mechanics": [
        "Fate Points can be spent to reroll dice for self or allies",
        "Can be used to force a critical success or failure on a single action",
        "Powerful destiny-altering abilities consume multiple Fate Points",
        "Can be invested in long-term prophecies for greater future effects"
      ]
    },
    {
      "name": "Destiny Threads",
      "description": "Tangible manifestations of fate that can be manipulated to create powerful effects",
      "max_value": "10 + (Charisma modifier)",
      "regeneration": "1 per hour, additional threads gained when significant events align with predictions",
      "mechanics": [
        "Threads can be woven into patterns that create various magical effects",
        "Can be attached to individuals to influence their destiny",
        "More complex patterns require more threads but produce more powerful effects",
        "Threads can be sacrificed to immediately alter the outcome of a critical event"
      ]
    }
  ],
  "class_mechanics": [
    {
      "name": "Advanced Divination",
      "description": "Mastery of techniques to glimpse possible futures with greater clarity and detail",
      "effects": [
        "Divination spells reveal more detailed and accurate information",
        "Can perceive multiple possible futures simultaneously",
        "Divinations can target specific aspects of the future with precision",
        "Successful divinations grant significant bonuses to related skill checks"
      ]
    },
    {
      "name": "Grand Prophecy",
      "description": "The ability to declare powerful prophecies that shape events on a larger scale",
      "effects": [
        "Prophecies affect larger areas and more targets",
        "Self-fulfilling prophecies provide more powerful buffs when conditions are met",
        "Doom prophecies apply stronger debuffs to enemies when triggered",
        "Can declare prophecies that affect entire regions or organizations"
      ]
    },
    {
      "name": "Destiny Manipulation",
      "description": "Direct control over the threads of fate to alter reality",
      "effects": [
        "Can significantly alter the outcome of events by manipulating probability",
        "Provides strong passive bonuses to saving throws and resistance checks",
        "Can protect multiple allies from critical hits simultaneously",
        "Can temporarily change a target's destined path"
      ]
    },
    {
      "name": "Tapestry Vision",
      "description": "The ability to perceive the interconnected web of fate that binds all beings",
      "effects": [
        "Can see connections between seemingly unrelated events",
        "Identifies key individuals who are nexus points in the tapestry of fate",
        "Reveals vulnerabilities in destiny patterns that can be exploited",
        "Grants immunity to fate manipulation attempts by others"
      ]
    }
  ],
  "skill_trees": [
    {
      "name": "Master Seer",
      "focus": "Enhanced divination and information gathering",
      "key_abilities": [
        "Omniscient Eye: Gain complete information about a target's past, present, and possible futures",
        "Fate Scrying: View the destiny threads of individuals or locations across vast distances",
        "Perfect Portent: Predict the exact outcome of complex events with perfect accuracy"
      ]
    },
    {
      "name": "Grand Prophet",
      "focus": "Powerful prophecies that shape reality",
      "key_abilities": [
        "World-Shaking Proclamation: Declare a prophecy that affects an entire region",
        "Inevitable Doom: Curse enemies with inescapable fate that manifests regardless of their actions",
        "Destiny Rewrite: Completely change the destined path of a willing subject"
      ]
    },
    {
      "name": "Destiny Architect",
      "focus": "Complex manipulation of fate threads",
      "key_abilities": [
        "Reality Weave: Create complex patterns of destiny threads to produce powerful magical effects",
        "Fate Severing: Completely cut a target's connection to their destined path",
        "Tapestry Manipulation: Rearrange the connections between individuals to create new destiny patterns"
      ]
    }
  ],
  "advancement_requirements": {
    "level": 10,
    "quests": ["Threads of Destiny", "Vision of the Tapestry"],
    "skill_points": "At least 5 points in any oracle skill tree",
    "challenges": ["Successfully predict the outcome of a major event"]
  },
  "progression_path": {
    "hero_classes": [
      {
        "id": "oracle_of_light",
        "name": "Oracle of Light",
        "alignment": "Good",
        "level_requirement": 30,
        "description": "Fateweavers who use their powers to guide others toward positive destinies and protect the world from calamity."
      },
      {
        "id": "cosmic_seer",
        "name": "Cosmic Seer",
        "alignment": "Neutral",
        "level_requirement": 30,
        "description": "Fateweavers who observe the grand tapestry of fate with detachment, seeking perfect knowledge of all possible futures."
      },
      {
        "id": "doom_prophet",
        "name": "Doom Prophet",
        "alignment": "Evil",
        "level_requirement": 30,
        "description": "Fateweavers who manipulate destiny to bring about catastrophe and rule through fear of their terrible predictions."
      }
    ]
  },
  "legendary_items": [
    {
      "name": "Crystal of Perfect Clarity",
      "type": "Focus",
      "effects": [
        "Divination spells cost 25% less mana",
        "Reveals one additional possible future when scrying",
        "Grants immunity to deception and illusion magic"
      ]
    },
    {
      "name": "Loom of Destiny",
      "type": "Relic",
      "effects": [
        "Maximum Destiny Threads increased by 5",
        "Destiny Thread regeneration increased by 1 per hour",
        "Can weave more complex fate patterns with fewer threads"
      ]
    }
  ],
  "lore": "Fateweavers represent the pinnacle of oracular power, having transcended mere glimpses of the future to achieve direct manipulation of destiny itself. Through years of study and meditation, they have learned to perceive the complex tapestry of fate that binds all living beings and events. More importantly, they have mastered the art of manipulating these threads, weaving new patterns that alter reality according to their will. Some Fateweavers use this power benevolently, guiding individuals and nations toward prosperity and peace. Others maintain a neutral stance, observing the grand design with detachment and intervening only to maintain cosmic balance. A few turn their abilities toward darker purposes, using their knowledge of future events to manipulate others and weaving patterns of destruction and suffering. Regardless of their moral alignment, all Fateweavers command tremendous respect and fear, as their proclamations can literally shape the future of the world."
}
