{
  "id": "evoker",
  "name": "Evoker",
  "base_class": "wizard",
  "description": "Wizards who have specialized in channeling and manipulating raw magical energies, creating powerful effects that can both destroy and transform the world around them through direct application of arcane force.",
  "level_requirement": 10,
  "role": "DPS-Control",
  "primary_stats": ["Intelligence", "Constitution"],
  "secondary_stats": ["Wisdom", "Dexterity"],
  "resource_systems": [
    {
      "name": "Mana",
      "description": "Magical energy that powers spellcasting and arcane abilities",
      "max_value": "30 + (Intelligence modifier × 6) + (level × 6)",
      "regeneration": "4 per 6 seconds, +7 when channeling or focusing magical energies",
      "mechanics": [
        "Mana points are spent to cast evocation spells and channel magical energies",
        "Some spells require maintaining focus, consuming mana over time",
        "Short rests restore a significant portion of maximum mana",
        "Depleted mana causes penalties to evocation power and channeling stability",
        "Can be temporarily boosted through magical artifacts or energy absorption",
        "Successful channeling of powerful energies restores a portion of mana"
      ]
    },
    {
      "name": "Arcane Focus",
      "description": "Mental concentration and magical attunement that enhances spellcasting effectiveness",
      "max_value": "150",
      "regeneration": "Builds when channeling magical energies successfully, decreases when control is lost",
      "mechanics": [
        "Increases by 15 when successfully channeling complex magical energies",
        "Increases by 10 per 10 seconds when maintaining control of powerful evocations",
        "Decreases by 15 when spells backfire or magical control is lost",
        "Decreases by 10 per minute when not actively channeling magic",
        "Can be spent to enhance evocation effects or stabilize chaotic energies",
        "Higher Arcane Focus increases evocation power and reduces chance of losing control"
      ]
    },
    {
      "name": "Magical Resonance",
      "description": "Attunement to magical energies that enhances evocation power and control",
      "max_value": "100",
      "regeneration": "Builds when casting evocation spells or absorbing magical energies",
      "mechanics": [
        "Increases by 10 when successfully casting powerful evocation spells",
        "Increases by 15 when absorbing ambient magical energies",
        "Decreases by 10 when evocation spells are resisted or countered",
        "Decreases by 15 when magical energies become unstable or chaotic",
        "Can be spent to amplify evocation power or stabilize magical channels",
        "Higher Magical Resonance increases the potency and control of evocation magic"
      ]
    }
  ],
  "class_mechanics": [
    {
      "name": "Energy Channeling",
      "description": "Ability to channel and direct raw magical energies",
      "effects": [
        "Can channel magical energies into powerful evocation effects",
        "Able to sustain magical channels for extended periods with proper control",
        "Can redirect and reshape magical energies during channeling",
        "Presence naturally attracts and concentrates ambient magical energies",
        "Can sense and tap into sources of magical power in the environment"
      ]
    },
    {
      "name": "Evocation Mastery",
      "description": "Specialized knowledge of evocation magic and energy manipulation",
      "effects": [
        "Can cast evocation spells with increased power and efficiency",
        "Able to modify evocation effects for specific tactical applications",
        "Can combine multiple energy types for complex evocation effects",
        "Presence enhances the evocation capabilities of allied spellcasters",
        "Can analyze and counter enemy evocation magic with precision"
      ]
    },
    {
      "name": "Magical Stability",
      "description": "Ability to control and stabilize volatile magical energies",
      "effects": [
        "Can handle dangerous levels of magical energy without losing control",
        "Able to stabilize chaotic magical effects and wild magic surges",
        "Can contain and direct explosive magical energies safely",
        "Presence naturally calms and stabilizes turbulent magical environments",
        "Can absorb excess magical energy to prevent destructive discharges"
      ]
    },
    {
      "name": "Energy Adaptation",
      "description": "Ability to adapt and transform magical energies between different forms",
      "effects": [
        "Can convert between different types of magical energy",
        "Able to adapt spells to overcome specific resistances or immunities",
        "Can transform harmful magical energies into beneficial effects",
        "Presence facilitates the transformation of magical energies",
        "Can analyze magical energy signatures and replicate their properties"
      ]
    }
  ],
  "skill_trees": [
    {
      "name": "Energy Manipulation",
      "focus": "Control and shaping of raw magical energies",
      "key_abilities": [
        "Energy Mastery: Achieve unprecedented control over specific energy types",
        "Power Channeling: Safely channel and direct enormous amounts of magical energy",
        "Energy Conversion: Transform magical energies between different forms and types"
      ]
    },
    {
      "name": "Evocation Specialist",
      "focus": "Mastery of evocation spells and effects",
      "key_abilities": [
        "Spell Amplification: Dramatically increase the power of evocation spells",
        "Precision Evocation: Control evocation effects with surgical precision",
        "Sustained Evocation: Maintain powerful evocation effects for extended durations"
      ]
    },
    {
      "name": "Magical Resonance",
      "focus": "Attunement to and manipulation of magical frequencies",
      "key_abilities": [
        "Resonant Casting: Attune spells to magical frequencies for enhanced effects",
        "Energy Absorption: Absorb ambient magical energies to power spells",
        "Harmonic Spellwork: Create complex magical effects through resonant harmonies"
      ]
    }
  ],
  "advancement_requirements": {
    "level": 10,
    "quests": ["The Channeler's Path", "Mastery of Energies"],
    "skill_points": "At least 5 points in any wizard skill tree",
    "challenges": ["Successfully channel a complex magical energy without losing control", "Demonstrate mastery of multiple evocation spell types"]
  },
  "progression_path": {
    "hero_classes": [
      {
        "id": "channeler",
        "name": "Channeler",
        "alignment": "Good",
        "level_requirement": 30,
        "description": "Evokers who channel magical energies to heal, protect, and enhance the natural world, serving as conduits for positive magical forces."
      },
      {
        "id": "eldritch",
        "name": "Eldritch",
        "alignment": "Neutral",
        "level_requirement": 30,
        "description": "Evokers who delve into strange and alien magical energies, manipulating reality and tapping into forces beyond normal comprehension."
      },
      {
        "id": "necromancer",
        "name": "Necromancer",
        "alignment": "Evil",
        "level_requirement": 30,
        "description": "Evokers who channel the energies of death and undeath, commanding undead minions and wielding life-draining magic."
      }
    ]
  },
  "legendary_items": [
    {
      "name": "Channeler's Focus",
      "type": "Focus",
      "effects": [
        "Increases magical energy channeling capacity by 50%",
        "Provides significant bonuses to evocation spell control",
        "Can store excess magical energy for later use"
      ]
    },
    {
      "name": "Resonance Crystal",
      "type": "Accessory",
      "effects": [
        "Enhances attunement to magical frequencies",
        "Allows visualization of magical energy flows",
        "Stabilizes chaotic magical energies in the vicinity"
      ]
    }
  ],
  "lore": "Evokers represent wizards who have transcended basic spellcasting to master the direct manipulation and channeling of raw magical energies. Where ordinary wizards might focus on a broad range of magical disciplines, Evokers specialize in harnessing, controlling, and directing the fundamental forces of magic itself, creating effects of tremendous power and precision. The path to becoming an Evoker often involves years of study focused specifically on energy manipulation and control, culminating in the ability to safely channel magical forces that would overwhelm or destroy less specialized practitioners. Those who succeed find themselves capable of wielding magical energies with unprecedented power and precision, shaping reality through the direct application of arcane force. Evokers serve various roles in magical society, from combat specialists who can unleash devastating magical attacks to researchers who explore new applications of energy manipulation and transformation. Some focus on practical applications of evocation magic, while others push the boundaries of what's possible through experimental channeling techniques and energy combinations. Their ability to control and direct magical energies with precision makes them invaluable in situations requiring the careful application of tremendous magical power. Though they may lack the versatility of generalist wizards or the subtle influence of enchanters, the raw power and precise control of Evokers allow them to achieve magical effects of unparalleled magnitude and impact, making them formidable allies and dangerous enemies in any magical conflict."
}
